In [ ]:
import pandas as pd
import pymysql
import warnings
warnings.filterwarnings('ignore')
#add the below connection variable if a new cell throws error. if you run connection.close() you need to reopen a connection.
connection = pymysql.connect(
    host='localhost',
    user='root',
    database='learning'
)

query = '''create table Grades (
	Student VARCHAR(9),
	Subject VARCHAR(21),
	Marks INT,
	core VARCHAR(50)
)'''

with connection.cursor() as cursor:
    cursor.execute(query)
    connection.commit()

In [21]:
sql_statements = [
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'Music', 67, 1);",
    "insert into Grades (Student, Subject, Marks, Core) values ('andy', 'Music', 65, 1);",
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'English', 93, 1);",
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'Theater', 76, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'Math', 90, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'Math', 98, 1);",
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'Music', 78, 1);",
    "insert into Grades (Student, Subject, Marks, Core) values ('sarah', 'English', 65, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('lucas', 'Music', 87, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('andy', 'Theater', 98, 1);",
    "insert into Grades (Student, Subject, Marks, Core) values ('sarah', 'Theater', 72, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('sarah', 'English', 86, 1);",
    "insert into Grades (Student, Subject, Marks, Core) values ('lucas', 'English', 66, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'Music', 71, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'English', 71, 1);",
    "insert into Grades (Student, Subject, Marks, Core) values ('lucas', 'Math', 88, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('lucas', 'English', 68, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('andy', 'English', 74, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('lucas', 'English', 60, 0);",
    "insert into Grades (Student, Subject, Marks, Core) values ('tracy', 'Music', 83, 0);"
]

for sql_statement in sql_statements:
    with connection.cursor() as cursor:
        cursor.execute(sql_statement)
        connection.commit()

In [25]:
sql_statements = [
"UPDATE grades SET core = 0 WHERE Subject NOT IN('Math','English')"
,
"UPDATE grades SET core = 1 WHERE Subject IN('Math','English')"
]

for sql_statement in sql_statements:
    with connection.cursor() as cursor:
        cursor.execute(sql_statement)
        connection.commit()

In [39]:
query = '''
SELECT *, MAX(CASE WHEN core=1 THEN 1 ELSE 0 END) OVER (PARTITION BY Student) firstyear FROM Grades;
'''

df_result = pd.read_sql(query, connection)

df_result
connection.close()

   Student  Subject  Marks core  firstyear
0     andy    Music     65    0          1
1     andy  Theater     98    0          1
2     andy  English     74    1          1
3    lucas    Music     87    0          1
4    lucas  English     66    1          1
5    lucas     Math     88    1          1
6    lucas  English     68    1          1
7    lucas  English     60    1          1
8    sarah  English     65    1          1
9    sarah  Theater     72    0          1
10   sarah  English     86    1          1
11   tracy    Music     67    0          1
12   tracy  English     93    1          1
13   tracy  Theater     76    0          1
14   tracy     Math     90    1          1
15   tracy     Math     98    1          1
16   tracy    Music     78    0          1
17   tracy    Music     71    0          1
18   tracy  English     71    1          1
19   tracy    Music     83    0          1